=======================================================================================================================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Kernel Shape              Param #                   Param %                   Mult-Adds                 Trainable
=======================================================================================================================================================================================================================
MyCustomModel                            [1, 1, 100]               [1, 1, 10]                --                        --                             --                   --                        True
├─Linear: 1-1                            [1, 1, 100]               [1, 1, 200]               --                        20,200                     90.95%                   20,200                    True
├─ReLU: 1-2                              [1, 1, 200]               [1, 1, 200]               --                        --                             --                   --                        --
├─Linear: 1-3                            [1, 1, 200]               [1, 1, 10]                --                        2,010                       9.05%                   2,010                     True
├─Softmax: 1-4                           [1, 1, 10]                [1, 1, 10]                --                        --                             --                   --                        --
=======================================================================================================================================================================================================================
Total params: 22,210
Trainable params: 22,210
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 0.02
=======================================================================================================================================================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 0.00
Params size (MB): 0.09
Estimated Total Size (MB): 0.09
=======================================================================================================================================================================================================================